app/Controllers/Login.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'test'
 LIMIT 1